applications/solvers/multiphase/phaseChangeHeatFoam/Validation/VerticalFilm/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-03;
y1 10;
x  0.5;

vertices        
(
    (0   0   0)
    ($x  0   0)
    (0   $y1 0)
    ($x  $y1 0)
   

    (0   0   0.0001)
    ($x  0   0.0001)
    (0   $y1 0.0001)
    ($x  $y1 0.0001)
    
);

blocks          
(
    hex (0 1 3 2 4 5 7 6) (150 300 1) simpleGrading (10 0.1 1)
    
);

edges           
(
);

patches         
(
  
    patch up	 
    (
        (2 3 7 6)
    )
    patch down	 
    (
      	(0 1 5 4)
    )
    patch left 
    (
       (0 2 6 4)
    )
    patch right 
    (
        (1 3 7 5)
    ) 
    empty front 
    (
        (0 1 3 2)
    )
    empty back 
    (
        (4 5 7 6)
    )
 
);

mergePatchPairs 
(
);

// ************************************************************************* //
