applications/solvers/multiphase/phaseChangeHeatFoam/Validation/VerticalFilm/0/alpha1.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    up
    {
        type            fixedValue;
        value           uniform 0;
    }
    down
    {
        type            zeroGradient;
    }
    left
    {
        type            zeroGradient;//constantAlphaContactAngle;
        gradient        uniform 0;
        limit           zeroGradient;
        theta0          0;
	//type		fixedValue;
        value           uniform 0.0;
    }
    right
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
